lookoutforchris/mcpserver-irix/packaging/man/mcpserverd.1m
.\" @(#)mcpserverd.1m  0.3.0  2026
.TH mcpserverd 1M "2026" "mcpserver-irix 0.3.0" "IRIX System Administration Commands"
.SH NAME
mcpserverd \- MCP server daemon for IRIX
.SH SYNOPSIS
.B /usr/sbin/mcpserverd
.RB [ \-f
.IR config ]
.RB [ \-d ]
.SH DESCRIPTION
.B mcpserverd
is a persistent local MCP (Model Context Protocol) server daemon.
It gives AI coding agents (Claude Code, Codex) bounded access to an
IRIX workspace over a UNIX-domain socket, without a public network
listener.
.PP
At startup the daemon:
.IP 1. 4
Opens syslog (facility
.BR LOG_DAEMON ).
.IP 2.
Loads the active policy from
.IR /etc/mcpserver/boundaries.json .
.IP 3.
Unlinks and binds a UNIX-domain socket at
.IR /var/run/mcpserverd.sock
(mode 0600, root-only).
.IP 4.
Writes its PID to
.IR /var/run/mcpserverd.pid .
.IP 5.
Enters the accept loop.
For each incoming connection a child process is forked to handle
that session; multiple
.BR "mcpserver stdio" (1)
sessions may be active concurrently.
.PP
The daemon remains running until it receives
.BR SIGTERM ,
which causes a clean shutdown: the socket is closed and unlinked,
the PID file is removed, and the process exits.
.PP
On
.B SIGHUP
the daemon reloads
.I /etc/mcpserver/boundaries.json
without dropping existing connections.
.PP
Under normal operation
.B mcpserverd
should not be invoked directly; use the
.BR mcpserver (1)
CLI or the init script.
.SH OPTIONS
.TP
.BI \-f " config"
Load the active policy from
.I config
instead of the default
.IR /etc/mcpserver/boundaries.json .
.I config
must be a fully-generated boundaries file (as produced by
.BR "mcpserver apply" );
it is not the operator registry.
.TP
.B \-d
Debug mode.
Do not daemonize.
Log to
.I stderr
in addition to syslog.
Useful when testing policy changes.
.SH FILES
.TP
.I /etc/mcpserver/boundaries.json
Active policy file.
Generated by
.BR "mcpserver apply" (1).
Loaded at startup and on
.BR SIGHUP .
Do not edit by hand; use the
.B mcpserver
CLI to modify the operator registry
.RI ( /etc/mcpserver/projects.json )
and regenerate.
.TP
.I /etc/mcpserver/projects.json
Operator project registry.
Managed with
.BR "mcpserver add" ,
.BR "mcpserver remove" ,
and
.BR "mcpserver apply" .
Not read directly by the daemon.
.TP
.I /var/run/mcpserverd.pid
PID file written at startup, removed on clean shutdown.
.TP
.I /var/run/mcpserverd.sock
UNIX-domain socket (AF_UNIX, SOCK_STREAM, mode 0600).
Framing: newline-delimited JSON-RPC 2.0.
.TP
.I /var/config/mcpserver
.BR chkconfig (1M)
flag file.
When present and enabled, the init script starts the daemon at boot.
.TP
.I /etc/init.d/mcpserverd
Init script.
Supports
.B start
and
.B stop
arguments.
.SH MCP TOOLS
.B mcpserverd
dispatches the following MCP tool requests to connected bridge clients.
.SS Read profile
.B ping ,
.B path_exists ,
.B stat_path ,
.B list_directory ,
.B read_text_file ,
.B tail_text_file ,
.B search_text ,
.B read_text_around_pattern ,
.B safe_json_preview ,
.B run_inspect_command
.SS Write profile (requires read_write root)
.B create_text_file ,
.B replace_text_file ,
.B make_directory ,
.B delete_text_file ,
.B rename_path
.SS Build profile (requires read_write root)
.B run_build_command ,
.B run_program
.PP
All tool access is gated by the active policy.
Read-only roots permit only the Read profile.
Read-write roots permit all three profiles.
Shell execution (inspect and build tools) is subject to an
allowed-commands list in
.IR boundaries.json .
.SH DIAGNOSTICS
All diagnostic messages are sent via
.BR syslog (3)
using facility
.B LOG_DAEMON
and the identity
.BR mcpserverd .
To view recent entries:
.PP
.RS
.B mcpserver logs
.RE
.PP
or directly:
.PP
.RS
.B grep mcpserverd /var/adm/SYSLOG | tail \-40
.RE
.SH "BOOT MANAGEMENT"
Enable the daemon at boot with:
.PP
.RS
.B mcpserver enable
.RE
.PP
or equivalently:
.PP
.RS
.B /sbin/chkconfig \-f mcpserver on
.br
.B /etc/init.d/mcpserverd start
.RE
.PP
Disable with:
.PP
.RS
.B mcpserver disable
.RE
.SH SIGNALS
.TP
.B SIGTERM
Graceful shutdown.
.TP
.B SIGHUP
Reload
.I /etc/mcpserver/boundaries.json
without restarting.
.SH "SEE ALSO"
.BR mcpserver (1),
.BR chkconfig (1M),
.BR syslog (3),
.BR signal (2)
.SH NOTES
.B mcpserverd
requires root privileges to bind
.I /var/run/mcpserverd.sock
and write
.IR /var/run/mcpserverd.pid .
.PP
The socket is created with mode 0600.
AI bridge sessions must run as root or the socket owner.
.PP
This program is part of the
.B mcpserver-irix
package, version 0.3.0.
